# IfcGuid Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..IfcGuid Property
ParameterTypeId Class See Also
---
"IfcGUID"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId IfcGuid { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property IfcGuid As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ IfcGuid {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace